# Intermediate in Pandas

In [12]:
import pandas as pd
import numpy as np

## Some basics stats using Pandas

In [2]:
df = pd.read_csv("https://raw.githubusercontent.com/crishernandezmaps/python_training/master/data/tobacco.csv",sep=",")
df.tail(10)

,Indicator,PUBLISH STATES,Year,WHO region,Country,Display Value,Numeric,Low,High,Comments
6198,Average - cigarette currency,Published,2014,Western Pacific,Malaysia,MYR,NaN,NaN,NaN,NaN
6199,Average - cigarette currency,Published,2014,Americas,Peru,PEN,NaN,NaN,NaN,NaN
6200,Average - cigarette currency,Published,2012,Western Pacific,Philippines,PHP,NaN,NaN,NaN,NaN
6201,Average - cigarette currency,Published,2012,Europe,Sweden,SEK,NaN,NaN,NaN,NaN
6202,Average - cigarette currency,Published,2012,Western Pacific,Singapore,SGD,NaN,NaN,NaN,NaN
6203,Average - cigarette currency,Published,2014,Africa,Sierra Leone,SLL,NaN,NaN,NaN,NaN
6204,Average - cigarette currency,Published,2012,Americas,Ecuador,USD,NaN,NaN,NaN,NaN
6205,Average - cigarette currency,Published,2014,Africa,Zimbabwe,USD,NaN,NaN,NaN,NaN
6206,Average - cigarette currency,Published,2014,Africa,Senegal,XOF,NaN,NaN,NaN,NaN
6207,Average - cigarette currency,Published,2012,Eastern Mediterranean,Yemen,YER,NaN,NaN,NaN,NaN

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6208 entries, 0 to 6207
Data columns (total 10 columns):
Indicator         6208 non-null object
PUBLISH STATES    6208 non-null object
Year              6208 non-null int64
WHO region        6208 non-null object
Country           6208 non-null object
Display Value     6208 non-null object
Numeric           2796 non-null float64
Low               0 non-null float64
High              0 non-null float64
Comments          2431 non-null object
dtypes: float64(3), int64(1), object(6)
memory usage: 485.1+ KB

In [4]:
df['Year'].sum()
df['Year'].cumsum()
df['Year'].mean()

2011.0

In [5]:
df['Country'].describe()

count       6208
unique       194
top       Greece
freq          32
Name: Country, dtype: object

In [6]:
df['Year'].count()
df['Year'].mean()
df['Year'].std()
df['Year'].min()
df['Year'].max()
df['Year'].median()

2011.0

In [7]:
x = df['Year'].std()
print("La desviacion estandar del año es: " + str(round(x,2)))

La desviacion estandar del año es: 2.24

In [8]:
print(df['Year'].mean(), df['Year'].describe()[0])

2011.0 6208.0

In [9]:
df.corr()
df.cov()

               Year       Numeric  Low  High
Year       5.000806  1.034956e+02  NaN   NaN
Numeric  103.495630  2.853145e+06  NaN   NaN
Low             NaN           NaN  NaN   NaN
High            NaN           NaN  NaN   NaN

## Join, Merge, Append and Concatenate dataframes

In [13]:
a = pd.DataFrame(np.random.random((5,3)), columns=['x1','x2','x3'])
b = pd.DataFrame(np.random.random((6,5)), columns=['y1','y2','x3','y4','y5'])

In [26]:
a

         x1        x2        x3
0  0.056014  0.556223  0.321706
1  0.659243  0.011174  0.272446
2  0.238455  0.868065  0.636748
3  0.382084  0.616612  0.483330
4  0.708804  0.904605  0.421148

In [13]:
b

         y1        y2        x3        y4        y5
0  0.934557  0.902908  0.502654  0.500391  0.196027
1  0.899578  0.289798  0.441114  0.616425  0.540659
2  0.459057  0.236640  0.777243  0.136283  0.428242
3  0.633913  0.400254  0.539142  0.971130  0.530622
4  0.362965  0.662236  0.743129  0.096773  0.372263
5  0.353321  0.747637  0.885137  0.990181  0.209602

In [27]:
a.insert(0, 'ID', range(879, 879 + len(a)))

In [28]:
b.insert(0, 'ID', range(880, 880 + len(b)))

In [33]:
#Working on 1D 
arr = np.arange(5) 
print("1D arr : \n", arr) 
print("Shape : ", arr.shape) 
z = np.insert(arr, 4, 9) 
print("\nArray after insertion : ", z) 
print("Shape : ", z.shape)

1D arr :
 [0 1 2 3 4]
Shape :  (5,)

Array after insertion :  [0 1 2 3 9 4]
Shape :  (6,)

In [34]:
a

    ID        x1        x2        x3
0  879  0.056014  0.556223  0.321706
1  880  0.659243  0.011174  0.272446
2  881  0.238455  0.868065  0.636748
3  882  0.382084  0.616612  0.483330
4  883  0.708804  0.904605  0.421148

In [35]:
b

    ID        y1        y2        x3        y4        y5
0  880  0.371134  0.248079  0.781467  0.414813  0.166878
1  881  0.037386  0.478039  0.065952  0.509563  0.295576
2  882  0.198883  0.946844  0.760458  0.785920  0.437999
3  883  0.407783  0.431212  0.788041  0.443548  0.196213
4  884  0.892041  0.943920  0.974018  0.092488  0.724056
5  885  0.702567  0.321748  0.005395  0.424443  0.302178

#### Join/Merge

In [53]:
# pd.merge(a, b, on='ID')
# pd.merge(a, b, on=['ID','x3'])
# pd.merge(a, b, how='outer', on='ID')
# pd.merge(a, b, how='inner', on=['ID','x3'])
pd.merge(a, b, how='outer', on=['ID','x3'])

     ID        x1        x2        x3        y1        y2        y4        y5
0   879  0.056014  0.556223  0.321706       NaN       NaN       NaN       NaN
1   880  0.659243  0.011174  0.272446       NaN       NaN       NaN       NaN
2   881  0.238455  0.868065  0.636748       NaN       NaN       NaN       NaN
3   882  0.382084  0.616612  0.483330       NaN       NaN       NaN       NaN
4   883  0.708804  0.904605  0.421148       NaN       NaN       NaN       NaN
5   880       NaN       NaN  0.781467  0.371134  0.248079  0.414813  0.166878
6   881       NaN       NaN  0.065952  0.037386  0.478039  0.509563  0.295576
7   882       NaN       NaN  0.760458  0.198883  0.946844  0.785920  0.437999
8   883       NaN       NaN  0.788041  0.407783  0.431212  0.443548  0.196213
9   884       NaN       NaN  0.974018  0.892041  0.943920  0.092488  0.724056
10  885       NaN       NaN  0.005395  0.702567  0.321748  0.424443  0.302178

In [54]:
pd.merge(a, b, on=['ID','x3'], how='inner')

Empty DataFrame
Columns: [ID, x1, x2, x3, y1, y2, y4, y5]
Index: []

##### Append/Concat

In [74]:
# List of dataframes
frames = [b,a]

In [80]:
# a.append(b)
# pd.concat(frames, sort=True)
# pd.concat(frames, keys=['pan', 'amasado'], sort=True)
# pd.concat(frames, sort=True, axis=0)
# pd.concat(frames, axis=1, join='outer', sort=True) # default
pd.concat(frames, axis=0, join='inner', sort=True)

    ID        x3
0  880  0.781467
1  881  0.065952
2  882  0.760458
3  883  0.788041
4  884  0.974018
5  885  0.005395
0  879  0.321706
1  880  0.272446
2  881  0.636748
3  882  0.483330
4  883  0.421148

## Using Functions

In [84]:
# How to transform all the numbers on a list to strings
listOfNumbers = np.arange(10)
listOfNumbers

array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

In [85]:
# Let's try a for loop
transformedElements = []
for i in listOfNumbers:
    transformedElements.append(i.astype(str))

transformedElements

['0', '1', '2', '3', '4', '5', '6', '7', '8', '9']

In [88]:
# Transform all this elements of this lists to strings
lists = np.random.randint(5, size=(5, 100)) # Numpy array with five lists of 10 elements
lists

array([[2, 4, 0, 3, 1, 1, 0, 2, 0, 2, 3, 4, 0, 1, 2, 2, 4, 3, 3, 2, 3, 0,
        2, 2, 2, 3, 2, 4, 4, 1, 2, 2, 4, 0, 1, 1, 2, 3, 2, 4, 4, 0, 2, 1,
        4, 0, 4, 0, 1, 0, 1, 3, 4, 0, 1, 2, 2, 2, 1, 4, 1, 2, 3, 2, 3, 4,
        1, 1, 4, 0, 2, 3, 2, 0, 0, 4, 1, 2, 0, 4, 0, 1, 2, 0, 3, 2, 2, 2,
        2, 1, 1, 1, 3, 4, 0, 0, 1, 1, 1, 3],
       [3, 2, 4, 2, 2, 0, 0, 1, 4, 0, 0, 3, 4, 3, 4, 0, 3, 0, 0, 2, 2, 4,
        3, 0, 2, 1, 3, 1, 1, 2, 4, 4, 2, 4, 4, 4, 0, 1, 2, 0, 0, 3, 4, 2,
        4, 1, 2, 1, 4, 3, 3, 1, 1, 2, 3, 3, 1, 3, 3, 0, 4, 1, 3, 3, 2, 2,
        1, 0, 3, 3, 0, 0, 4, 1, 4, 1, 4, 2, 1, 3, 3, 1, 0, 1, 3, 4, 3, 2,
        4, 2, 1, 0, 1, 3, 2, 1, 3, 1, 0, 4],
       [2, 3, 0, 3, 0, 3, 3, 0, 4, 0, 1, 3, 3, 2, 4, 1, 1, 4, 2, 1, 1, 0,
        0, 3, 3, 3, 3, 2, 3, 4, 0, 0, 3, 2, 0, 1, 1, 3, 1, 3, 3, 4, 0, 4,
        2, 4, 4, 1, 4, 0, 3, 2, 0, 3, 1, 0, 0, 0, 3, 3, 4, 1, 0, 1, 0, 1,
        0, 4, 3, 0, 4, 2, 3, 2, 0, 4, 3, 2, 3, 3, 4, 0, 0, 0, 0, 0, 2, 2,
        2, 4, 1, 2, 2, 4, 1, 4, 2, 0, 3, 4],
       [1, 4, 1, 0, 0, 4, 1, 1, 2, 1, 0, 4, 0, 0, 3, 4, 0, 2, 3, 0, 3, 2,
        3, 4, 0, 1, 0, 1, 0, 4, 0, 1, 1, 1, 2, 2, 4, 1, 1, 3, 3, 3, 1, 0,
        0, 1, 2, 1, 2, 2, 3, 2, 3, 3, 2, 4, 1, 4, 4, 4, 0, 1, 0, 1, 1, 4,
        0, 3, 3, 0, 0, 4, 3, 2, 2, 1, 1, 4, 1, 1, 0, 1, 1, 3, 0, 3, 0, 0,
        3, 2, 2, 3, 0, 1, 2, 1, 2, 2, 0, 2],
       [4, 4, 0, 0, 2, 4, 0, 2, 1, 1, 3, 2, 4, 0, 4, 4, 2, 0, 1, 2, 4, 4,
        1, 4, 0, 1, 4, 3, 2, 4, 4, 2, 3, 1, 4, 0, 4, 4, 1, 0, 4, 4, 4, 1,
        3, 0, 0, 2, 1, 3, 1, 1, 2, 1, 3, 3, 1, 0, 1, 3, 3, 2, 1, 2, 3, 3,
        2, 0, 2, 3, 3, 2, 4, 2, 3, 4, 2, 0, 0, 3, 0, 1, 4, 3, 0, 1, 0, 3,
        1, 3, 3, 1, 2, 0, 0, 3, 0, 0, 2, 2]])

In [89]:
lists[0] # First list

array([2, 4, 0, 3, 1, 1, 0, 2, 0, 2, 3, 4, 0, 1, 2, 2, 4, 3, 3, 2, 3, 0,
       2, 2, 2, 3, 2, 4, 4, 1, 2, 2, 4, 0, 1, 1, 2, 3, 2, 4, 4, 0, 2, 1,
       4, 0, 4, 0, 1, 0, 1, 3, 4, 0, 1, 2, 2, 2, 1, 4, 1, 2, 3, 2, 3, 4,
       1, 1, 4, 0, 2, 3, 2, 0, 0, 4, 1, 2, 0, 4, 0, 1, 2, 0, 3, 2, 2, 2,
       2, 1, 1, 1, 3, 4, 0, 0, 1, 1, 1, 3])

In [98]:
rom decimal import *

In [102]:
Decimal(10)

Decimal('10')

In [113]:
def transform(aListOrArrayOfLists):
    finalResults = []
    for i in aListOrArrayOfLists:
        partialResults = []
        for x in i:
            partialResults.append("{:0.4f}".format(x))
        finalResults.append(partialResults)
    return finalResults

transform(lists)[0]

['2.0000',
 '4.0000',
 '0.0000',
 '3.0000',
 '1.0000',
 '1.0000',
 '0.0000',
 '2.0000',
 '0.0000',
 '2.0000',
 '3.0000',
 '4.0000',
 '0.0000',
 '1.0000',
 '2.0000',
 '2.0000',
 '4.0000',
 '3.0000',
 '3.0000',
 '2.0000',
 '3.0000',
 '0.0000',
 '2.0000',
 '2.0000',
 '2.0000',
 '3.0000',
 '2.0000',
 '4.0000',
 '4.0000',
 '1.0000',
 '2.0000',
 '2.0000',
 '4.0000',
 '0.0000',
 '1.0000',
 '1.0000',
 '2.0000',
 '3.0000',
 '2.0000',
 '4.0000',
 '4.0000',
 '0.0000',
 '2.0000',
 '1.0000',
 '4.0000',
 '0.0000',
 '4.0000',
 '0.0000',
 '1.0000',
 '0.0000',
 '1.0000',
 '3.0000',
 '4.0000',
 '0.0000',
 '1.0000',
 '2.0000',
 '2.0000',
 '2.0000',
 '1.0000',
 '4.0000',
 '1.0000',
 '2.0000',
 '3.0000',
 '2.0000',
 '3.0000',
 '4.0000',
 '1.0000',
 '1.0000',
 '4.0000',
 '0.0000',
 '2.0000',
 '3.0000',
 '2.0000',
 '0.0000',
 '0.0000',
 '4.0000',
 '1.0000',
 '2.0000',
 '0.0000',
 '4.0000',
 '0.0000',
 '1.0000',
 '2.0000',
 '0.0000',
 '3.0000',
 '2.0000',
 '2.0000',
 '2.0000',
 '2.0000',
 '1.0000',
 '1.0000',
 '1.0000',
 '3.0000',
 '4.0000',
 '0.0000',
 '0.0000',
 '1.0000',
 '1.0000',
 '1.0000',
 '3.0000']

In [121]:
### Let's use functions to expand our data
### Data source: http://www.isdscotland.org/Health-Topics/Cancer/Publications/data-tables2017.asp?id=1902#1902 
! pwd && ls

/Users/tremen/Desktop/python_training
App.ipynb                    pandas_02.ipynb
README.md                    pandas_numpy_funciones.ipynb
data                         para_patricio.csv
flask-app.py                 seaborn-data
home.html                    table_from_csv.xlsx
pandas3.ipynb                table_from_html.xlsx
pandas_01.ipynb

In [119]:
data = pd.read_excel('/Users/tremen/Desktop/cancer_all_types.xls', sheet_name=6)
data.columns

Index(['id', 'hbnew', 'hb_label', 'sitenew', 'site_label', 'sexnew',
       'sex_label', 'label', 'age_label', 'trans1.1991', 'trans1.1992',
       'trans1.1993', 'trans1.1994', 'trans1.1995', 'trans1.1996',
       'trans1.1997', 'trans1.1998', 'trans1.1999', 'trans1.2000',
       'trans1.2001', 'trans1.2002', 'trans1.2003', 'trans1.2004',
       'trans1.2005', 'trans1.2006', 'trans1.2007', 'trans1.2008',
       'trans1.2009', 'trans1.2010', 'trans1.2011', 'trans1.2012',
       'trans1.2013', 'trans1.2014', 'trans1.2015'],
      dtype='object')

In [127]:
data['site_label'].unique()

array(['All cancer types'], dtype=object)

In [128]:
data['site_label'].describe()

count                 1152
unique                   1
top       All cancer types
freq                  1152
Name: site_label, dtype: object

In [130]:
women = data.loc[data['sex_label'] == 'Females']
wy2015 = women.loc[:,['age_label','trans1.2015']]

In [29]:
wy2015.describe()

        trans1.2015
count    384.000000
mean     590.553925
std     1075.068354
min        2.000000
25%      104.529850
50%      365.500000
75%      604.129035
max    16266.000000

In [133]:
from random import * # Library to create a random number

# Create a new column using min and max using 'trans1.2015' column
wy2015['fixed'] = 100 
wy2015.head()

                            age_label  trans1.2015  fixed
98   Number of registrations: Under 5         36.0    100
99       Number of registrations: 5..         14.0    100
100    Number of registrations: 10-14         10.0    100
101    Number of registrations: 15-19         35.0    100
102    Number of registrations: 20-24         64.0    100

In [134]:
wy2015['func_inside'] = wy2015['trans1.2015'].apply(lambda row: row + randint(wy2015['trans1.2015'].min(),100))
wy2015.head()

                            age_label  trans1.2015  fixed  func_inside
98   Number of registrations: Under 5         36.0    100        124.0
99       Number of registrations: 5..         14.0    100         94.0
100    Number of registrations: 10-14         10.0    100         66.0
101    Number of registrations: 15-19         35.0    100         98.0
102    Number of registrations: 20-24         64.0    100         97.0

In [32]:
functionOutside = lambda row: row + randint(wy2015['trans1.2015'].min(),wy2015['trans1.2015'].max())

wy2015['funcOutVar'] = wy2015['trans1.2015'].apply(functionOutside)
wy2015.head()

,age_label,trans1.2015,fixed,func_inside,funcOutVar
98,Number of registrations: Under 5,36.0,100,65.0,4880.0
99,Number of registrations: 5..,14.0,100,58.0,6011.0
100,Number of registrations: 10-14,10.0,100,94.0,12684.0
101,Number of registrations: 15-19,35.0,100,96.0,10310.0
102,Number of registrations: 20-24,64.0,100,86.0,8513.0

In [135]:
def expandingData(row):
    return np.sqrt(row['trans1.2015'])

wy2015['funcOut'] = wy2015.apply(lambda row: expandingData(row), axis=1)
wy2015.head()

,age_label,trans1.2015,fixed,func_inside,funcOut
98,Number of registrations: Under 5,36.0,100,124.0,6.000000
99,Number of registrations: 5..,14.0,100,94.0,3.741657
100,Number of registrations: 10-14,10.0,100,66.0,3.162278
101,Number of registrations: 15-19,35.0,100,98.0,5.916080
102,Number of registrations: 20-24,64.0,100,97.0,8.000000

In [34]:
strings = lambda row: row.split(":")[-1].strip()

wy2015['age_label'] = wy2015['age_label'].map(strings)
wy2015.head()

    age_label  trans1.2015  fixed  func_inside  funcOutVar   funcOut
98    Under 5         36.0    100         65.0      4880.0  6.000000
99        5..         14.0    100         58.0      6011.0  3.741657
100     10-14         10.0    100         94.0     12684.0  3.162278
101     15-19         35.0    100         96.0     10310.0  5.916080
102     20-24         64.0    100         86.0      8513.0  8.000000

In [35]:
result = wy2015.loc[wy2015['age_label'] == '15-19']
result

    age_label  trans1.2015  fixed  func_inside    funcOutVar   funcOut
101     15-19    35.000000    100    96.000000  10310.000000  5.916080
121     15-19    23.614185    100   122.614185   4480.614185  4.859443
252     15-19     5.000000    100    46.000000  14334.000000  2.236068
272     15-19    13.241175    100   101.241175   6163.241175  3.638843
405     15-19     9.000000    100    78.000000   9553.000000  3.000000
425     15-19    22.088058    100   121.088058  10898.088058  4.699793
558     15-19    21.000000    100   107.000000  14900.000000  4.582576
578     15-19    30.125235    100   108.125235   5889.125235  5.488646

## Test

In [36]:
# Parse HTML data from Wikipedia with numerical data
# Loc cases choosing values more than the mean of a Series
# Expand that dataset creating a new column based on a previous column. Use Lambda function (Map type)
# Export your results to a CSV

Project plannning!!!